mimas9107/esp-miao/firmware/esp32_edge_impulse/main/main.cpp
    int32_t i2s_buf[chunk_frames * 2];

    size_t samples_read = 0;
    float sum_sq = 0.0f;

    while (samples_read < num_mono_samples) {
        size_t frames_to_read = num_mono_samples - samples_read;
        if (frames_to_read > chunk_frames) frames_to_read = chunk_frames;

        size_t bytes_read = 0;
        esp_err_t ret = i2s_channel_read(rx_chan, i2s_buf,
                                         frames_to_read * 2 * bytes_per_sample,
                                         &bytes_read, 1000);
        if (ret != ESP_OK) {
            printf("ERR: I2S read failed: %d\r\n", ret);
            return false;
        }

        size_t got_frames = bytes_read / (2 * bytes_per_sample);

        for (size_t i = 0; i < got_frames; i++) {
            int32_t raw_l = i2s_buf[i * 2];
            int32_t s = raw_l >> 11;
            
            if (s > 32767)  s = 32767;
            if (s < -32768) s = -32768;
            
            out_buffer[samples_read + i] = (float)s;
            sum_sq += (float)(s * s);
        }
        samples_read += got_frames;
    }

    if (out_rms) {
        *out_rms = sqrtf(sum_sq / num_mono_samples);
    }

    return true;
}

/* ---------- Read Audio to Int16 Buffer (Stereo -> Mono Left) ---------- */

static bool read_audio_to_buffer(int16_t *out_buffer, size_t num_samples)
{
    const size_t bytes_per_sample = sizeof(int32_t);
    const size_t chunk_frames = 256;
    
    int32_t i2s_buf[chunk_frames * 2];

    size_t samples_read = 0;

    while (samples_read < num_samples) {
        size_t frames_to_read = num_samples - samples_read;
        if (frames_to_read > chunk_frames) frames_to_read = chunk_frames;

        size_t bytes_read = 0;
        esp_err_t ret = i2s_channel_read(rx_chan, i2s_buf,
                                         frames_to_read * 2 * bytes_per_sample,
                                         &bytes_read, 1000);
        if (ret != ESP_OK) {
            printf("ERR: I2S read failed: %d\r\n", ret);
            return false;
        }

        size_t got_frames = bytes_read / (2 * bytes_per_sample);

        for (size_t i = 0; i < got_frames; i++) {
            int32_t raw_l = i2s_buf[i * 2];
            int32_t s = raw_l >> 11;
            
            if (s > 32767)  s = 32767;
            if (s < -32768) s = -32768;
            
            out_buffer[samples_read + i] = (int16_t)s;
        }
        samples_read += got_frames;
    }

    return true;
}

/* ============================================================
 * VAD 方法: FFT 頻域能量分析
 * 計算特定頻率範圍內的能量，可過濾非人聲頻率
 * ============================================================ */

/**
 * 簡單的 FFT 計算 (Radix-2 DIT)
 * @param real 實部陣列 (輸入/輸出)
 * @param imag 虛部陣列
 * @param n FFT 點數 (需為 2 的冪)
 */
static void vad_fft_compute(float *real, float *imag, int n)
{
    int j = 0;
    
    // Bit reversal
    for (int i = 0; i < n - 1; i++) {
        if (i < j) {
            float temp_r = real[i];
            float temp_i = imag[i];
            real[i] = real[j];
            imag[i] = imag[j];
            real[j] = temp_r;
            imag[j] = temp_i;
        }
        int k = n / 2;
        while (k <= j) {
            j -= k;
            k /= 2;
        }
        j += k;
    }
    
    // Cooley-Tukey FFT
    for (int len = 2; len <= n; len *= 2) {
        float angle = -2.0f * M_PI / len;
        float wlen_r = cosf(angle);
        float wlen_i = sinf(angle);
        
        for (int i = 0; i < n; i += len) {
            float wr = 1.0f;
            float wi = 0.0f;
            
            for (int k = 0; k < len / 2; k++) {
                float u_r = real[i + k];
                float u_i = imag[i + k];
                float t_r = wr * real[i + k + len/2] - wi * imag[i + k + len/2];
                float t_i = wr * imag[i + k + len/2] + wi * real[i + k + len/2];
                
                real[i + k] = u_r + t_r;
                imag[i + k] = u_i + t_i;
                real[i + k + len/2] = u_r - t_r;
                imag[i + k + len/2] = u_i - t_i;
                
                float wr_new = wr * wlen_r - wi * wlen_i;
                float wi_new = wr * wlen_i + wi * wlen_r;
                wr = wr_new;
                wi = wi_new;
            }
        }
    }
}

/**
 * 新方法 VAD 判定 (FFT 頻域分析)
 * 使用簡化的頻帶能量計算
 * @param buffer 音訊資料 (float)
 * @param length 樣本數量 (需 >= FFT_SIZE)
 * @param fft_energy_out 輸出 FFT 能量值 (可為 NULL)
 * @return true = 偵測到語音, false = 安靜
 */
static bool vad_new_fft_detect(const float *buffer, size_t length, float *fft_energy_out)
{
    if (length < FFT_SIZE) {
        if (fft_energy_out) *fft_energy_out = 0;
        return false;
    }
    
    // 準備 FFT 資料
    static float real[FFT_SIZE];
    static float imag[FFT_SIZE];
    
    // 複製資料
    for (int i = 0; i < FFT_SIZE; i++) {
        real[i] = buffer[i];
        imag[i] = 0.0f;
    }
    
    // Hamming Window
    for (int i = 0; i < FFT_SIZE; i++) {
        float window = 0.54f - 0.46f * cosf(2.0f * M_PI * i / (FFT_SIZE - 1));
        real[i] *= window;
    }
    
    // 執行 FFT
    vad_fft_compute(real, imag, FFT_SIZE);
    
    // 計算人聲頻段能量 (300-3400Hz)
    int start_bin = (FFT_FREQ_MIN * FFT_SIZE) / SAMPLE_RATE;
    int end_bin = (FFT_FREQ_MAX * FFT_SIZE) / SAMPLE_RATE;
    
    float sum_sq = 0.0f;
    int bin_count = 0;
    
    for (int i = start_bin; i < end_bin && i < FFT_SIZE/2; i++) {
        float mag = sqrtf(real[i] * real[i] + imag[i] * imag[i]);
        sum_sq += mag * mag;  // 累加能量的平方
        bin_count++;
    }
    
    float band_rms = (bin_count > 0) ? sqrtf(sum_sq / bin_count) : 0.0f;
    
    if (fft_energy_out) {
        *fft_energy_out = band_rms;
    }
    
    return (band_rms > FFT_ENERGY_THRESHOLD);
}

/**
 * VAD 偵測接口 (含統計顯示)
 * @param buffer 音訊資料
 * @param length 樣本數量
 * @param rms_val 輸出 RMS 值 (可為 NULL)
 * @param fft_energy 輸出 FFT 能量值 (可為 NULL)
 * @return true = 偵測到語音, false = 安靜
 */
static bool vad_detect(const float *buffer, size_t length, 
                       float *rms_val, float *fft_energy)
{
    // 計算 RMS (僅用於調試顯示與基準比較)
    if (rms_val) {
        float sum_sq = 0.0f;
        for (size_t i = 0; i < length; i++) {
            sum_sq += buffer[i] * buffer[i];
        }
        *rms_val = sqrtf(sum_sq / length);
    }
    
